In [41]:
import pandas as pd
import numpy as np
import scipy.stats as stats
import seaborn as sns

In [ ]:
df = pd.read_excel('file_python.xlsx')
df.describe()

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 487008 entries, 0 to 487007
Data columns (total 59 columns):
 #   Column                        Non-Null Count   Dtype
---  ------                        --------------   -----
 0   create_month                  487008 non-null  datetime64[ns]
 1   create_date                   477771 non-null  datetime64[ns]
 2   report_date                   487008 non-null  datetime64[ns]
 3   m_diff                        487008 non-null  object
 4   cluster_name                  477771 non-null  object
 5   macroregion                   477771 non-null  object
 6   region                        477771 non-null  object
 7   cust_id                       477771 non-null  float64
 8   subs_id                       487008 non-null  int64
 9   msisdn                        487008 non-null  int64
 10  lt_day                        477771 non-null  float64
 11  lt_gr                         477771 non-null  object
 12  age                           477771 non-null  float64
 13  age_gr                        474286 non-null  object
 14  gender                        476946 non-null  object
 15  tp_id                         477771 non-null  float64
 16  tp_grade                      477771 non-null  object
 17  tp_concept                    477771 non-null  object
 18  start_dttm                    477771 non-null  datetime64[ns]
 19  end_dttm                      477771 non-null  object
 20  diff_day_tp                   391471 non-null  float64
 21  m_diff_tp                     391471 non-null  object
 22  m_diff_tp2                    391471 non-null  object
 23  nps                           477771 non-null  float64
 24  nps_key                       477771 non-null  float64
 25  total_revenue                 477771 non-null  float64
 26  subs_fee                      477771 non-null  float64
 27  serv_rev                      477771 non-null  float64
 28  cm1                           477771 non-null  float64
 29  cm2                           477771 non-null  float64
 30  cm4                           477771 non-null  float64
 31  cm1_cost                      477771 non-null  float64
 32  voice_min                     477771 non-null  float64
 33  data_traffic                  477771 non-null  float64
 34  rev_flg                       477771 non-null  float64
 35  subs_fee_flg                  477771 non-null  float64
 36  voice_flg                     477771 non-null  float64
 37  data_flg                      477771 non-null  float64
 38  adu_flg                       477771 non-null  float64
 39  day_tp_flg                    477771 non-null  float64
 40  change_tp_flg                 487008 non-null  int64
 41  subs_cnt                      487008 non-null  int64
 42  revenue_cnt                   487008 non-null  int64
 43  voice_cnt                     487008 non-null  int64
 44  data_cnt                      487008 non-null  int64
 45  cm1_cnt                       487008 non-null  int64
 46  cm2_cnt                       487008 non-null  int64
 47  cm4_cnt                       487008 non-null  int64
 48  cm1_cost_cnt                  487008 non-null  int64
 49  disc_flg                      487008 non-null  int64
 50  cls                           487008 non-null  int64
 51  ls                            487008 non-null  int64
 52  revenue_total_cls             487008 non-null  float64
 53  data_traffic_cls              487008 non-null  float64
 54  min_total_cls                 487008 non-null  float64
 55  cls_flg                       487008 non-null  int64
 56  create_month (Индекс месяца)  487008 non-null  int64
 57  create_month (Месяц)          487008 non-null  object
 58  share                         487008 non-null  float64
dtypes: datetime64[ns](4), float64(26), int64(16), object(13)
memory usage: 219.2+ MB

In [116]:
df_f = df[["total_revenue", "region", 'm_diff', 'subs_id']] #
df_f = df_f.dropna (subset=['total_revenue'])
df_f.isnull().sum ()

        total_revenue       region m_diff       subs_id
0                0.00    Волгоград   lt-3      66763838
1                0.00  С.Петербург   lt-3  200085248261
2                0.00        Пермь   lt-4  300000826974
3                0.00    Волгоград   lt-4      66763838
4                0.00     Белгород   lt-5      61323598
...               ...          ...    ...           ...
487003         400.95       Москва   lt-8  300005160152
487004         446.98       Москва   lt-9  300005160152
487005         445.99       Москва  lt-10  300005160152
487006         328.18       Москва  lt-11  300005160152
487007         649.48       Москва  lt-12  300005160152

[487008 rows x 4 columns]

In [102]:
q1 = -0.6745
q3 = 0.6745
 
iqr = q3 - q1
 
lower_bound = q1 - (1.5 * iqr) 
upper_bound = q3 + (1.5 * iqr)
 
# тогда lower_bound и upper_bound почти равны трем СКО от среднего
# (было бы точнее, если использовать 1.75)
print(lower_bound, upper_bound)

-2.698 2.698

In [119]:
df_f.reset_index(drop= True , inplace= True )
df_f.head(10)

In [121]:
# пункт два через квартили
x = df_f
x['result'] = np.nan 
total_df = pd.DataFrame()
for region in x['region'].unique().tolist():
    tmp_df = x[x['region'] == region]
    #tmp_df.drop('Region', axis= 1 , inplace= True )
    #межквартильный 
    Q1 = np.percentile(tmp_df['total_revenue'], 25,interpolation = 'midpoint')
    Q3 = np.percentile(tmp_df['total_revenue'], 75,interpolation = 'midpoint')
    IQR = Q3 - Q1
    # Above Upper bound
    upper=Q3+1.5*IQR
    #Below Lower bound
    lower=Q1-1.5*IQR
    for i,row in tmp_df.iterrows():
        if row['total_revenue']>=upper or row['total_revenue']<=lower:
            tmp_df.loc[i,'result'] = tmp_df.loc[i,'total_revenue'] 
    total_df = pd.concat([total_df, tmp_df])
total_df

In [122]:
total_df.to_excel('qwess.xlsx')

In [ ]:
df_ = pd.merge(df, df_f,  how = 'left' , left_on=['subs_id', 'region', 'm_diff'], right_on = ['subs_id','region', 'm_diff'] )
df_

In [128]:
df_.to_excel('zxcf.xlsx')